#include<stdio.h>
#include <stdlib.h>
#include <ctype.h>
struct Data
{
    int Ew,Iw,Ed,Id;             //能力值:外功，內功，外防，內防。
    int CP;                            //戰力
};
struct Mode
{
    Data data;
};
void prarr(int cr,int ht1,int ht2)
{
    if(cr==1)
    {
        printf("腳色職業:【**太白**】");
    }
    else if(cr==2)
    {
        printf("腳色職業:【**神威**】");
    }
    else if(cr==3)
    {
        printf("腳色職業:【**神刀**】");
    }
    else if(cr==4)
    {
        printf("腳色職業:【**真武**】");
    }
    else if(cr==5)
    {
         printf("腳色職業:【**五毒**】");
    }
    else if(cr==6)
    {
        printf("腳色職業:【**丐幫**】");
    }
    else if(cr==7)
    {
        printf("腳色職業:【**天香**】");
    }
    else if(cr==8)
    {
        printf("腳色職業:【**唐門**】");
    }

    printf("\n");
    if(ht1==1)
        printf("心法刻印:【歸鞘】");
    else if(ht1==2)
        printf("心法刻印:【厚德】");
    else if(ht1==3)
        printf("心法刻印:【白刃】");
    else if(ht1==4)
        printf("心法刻印:【修羅】");
    else if(ht1==5)
        printf("心法刻印:【同袍】");
    else if(ht1==6)
        printf("心法刻印:【征旗】");
    else if(ht1==7)
        printf("心法刻印:【青鳥】");
    else if(ht1==8)
        printf("心法刻印:【金戈】");
    else if(ht1==9)
        printf("心法刻印:【鐵馬】");
    else if(ht1==10)
        printf("心法刻印:【獅吼】");
    else if(ht1==11)
        printf("心法刻印:【無滅】");
    else if(ht1==12)
        printf("心法刻印:【極樂】");
    else if(ht1==13)
        printf("心法刻印:【靈素】");
    else if(ht1==14)
        printf("心法刻印:【偃師】");
    else if(ht1==15)
        printf("心法刻印:【長天】");
    else if(ht1==16)
        printf("心法刻印:【速生】");
    else if(ht1==17)
        printf("心法刻印:【饕餮】");
    else if(ht1==18)
        printf("心法刻印:【尋歡】");
    else if(ht1==19)
        printf("心法刻印:【地藏】");
    else if(ht1==20)
        printf("心法刻印:【善緣】");
    else if(ht1==21)
        printf("心法刻印:【絕命】");
    else if(ht1==22)
        printf("心法刻印:【無生】");
    else if(ht1==23)
        printf("心法刻印:【九嬰】");
    else if(ht1==24)
        printf("心法刻印:【止殺】");
    else if(ht1==25)
        printf("心法刻印:【悲回風】");
    else if(ht1==26)
        printf("心法刻印:【殺菩提】");
    else if(ht1==27)
        printf("心法刻印:【羅喉訣】");
    else if(ht1==28)
        printf("心法刻印:【淬火流毒】");
    else if(ht1==29)
        printf("心法刻印:【風華玉碎】");
    else if(ht1==30)
        printf("心法刻印:【煉武力道】");
    else if(ht1==31)
        printf("心法刻印:【煉武氣勁】");
    else if(ht1==32)
        printf("心法刻印:【煉武根骨】");
    else if(ht1==33)
        printf("心法刻印:【煉武洞察】");
    else if(ht1==34)
        printf("心法刻印:【煉武身法】");
    else if(ht1==35)
        printf("心法刻印:【刑天滄海】");
    else if(ht1==36)
        printf("心法刻印:【獵風沈舟】");
    else if(ht1==37)
        printf("心法刻印:【嘯天鎮岳】");
    else if(ht1==38)
        printf("心法刻印:【拜月冰心】");


    if(ht2==1)
        printf("【歸鞘】");
    else if(ht2==2)
        printf("【厚德】");
    else if(ht2==3)
        printf("【白刃】");
    else if(ht2==4)
        printf("【修羅】");
    else if(ht2==5)
        printf("【同袍】");
    else if(ht2==6)
        printf("【征旗】");
    else if(ht2==7)
        printf("【青鳥】");
    else if(ht2==8)
        printf("【金戈】");
    else if(ht2==9)
        printf("【鐵馬】");
    else if(ht2==10)
        printf("【獅吼】");
    else if(ht2==11)
        printf("【無滅】");
    else if(ht2==12)
        printf("【極樂】");
    else if(ht2==13)
        printf("【靈素】");
    else if(ht2==14)
        printf("【偃師】");
    else if(ht2==15)
        printf("【長天】");
    else if(ht2==16)
        printf("【速生】");
    else if(ht2==17)
        printf("【饕餮】");
    else if(ht2==18)
        printf("【尋歡】");
    else if(ht2==19)
        printf("【地藏】");
    else if(ht2==20)
        printf("【善緣】");
    else if(ht2==21)
        printf("【絕命】");
    else if(ht2==22)
        printf("【無生】");
    else if(ht2==23)
        printf("【九嬰】");
    else if(ht2==24)
        printf("【止殺】");
    else if(ht2==25)
        printf("【悲回風】");
    else if(ht2==26)
        printf("【殺菩提】");
    else if(ht2==27)
        printf("【羅喉訣】");
    else if(ht2==28)
        printf("【淬火流毒】");
    else if(ht2==29)
        printf("【風華玉碎】");
    else if(ht2==30)
        printf("【煉武力道】");
    else if(ht2==31)
        printf("【煉武氣勁】");
    else if(ht2==32)
        printf("【煉武根骨】");
    else if(ht2==33)
        printf("【煉武洞察】");
    else if(ht2==34)
        printf("【煉武身法】");
    else if(ht2==35)
        printf("【刑天滄海】");
    else if(ht2==36)
        printf("【獵風沈舟】");
    else if(ht2==37)
        printf("【嘯天鎮岳】");
    else if(ht2==38)
        printf("【拜月冰心】");

    printf("\n");
}
void list3(int ht1,int ht2,int cr)
{
    int a[38];
    int m[5];
    int p1[5]= {44,69,109,49,76};;
    int p2[5]= {44,151,87,44,44};
    int p3[5]= {82,90,80,72,57};
    int p4[5]= {114,89,87,184,100};
    int p5[5]= {149,87,84,67,172};
    int p6[5]= {100,103,52,105,72};
    int p7[5]= {99,103,78,89,161};
    int p8[5]= {105,120,133,80,78};
    int p9[5]= {150,125,99,97,110};
    int p10[5]= {116,139,105,114,107};
    int p11[5]= {98,96,144,82,130};
    int p12[5]= {126,100,106,163,156};
    int p13[5]= {205,104,98,180,131};
    int p14[5]= {67,60,85,66,124};
    int p15[5]= {93,152,75,82,133};
    int p16[5]= {156,79,78,91,113};
    int p17[5]= {104,98,101,169,195};
    int p18[5]= {116,212,121,155,120};
    int p19[5]= {271,144,123,133,139};
    int p20[5]= {105,209,140,111,111};
    int p21[5]= {114,115,227,91,91};
    int p22[5]= {119,111,88,229,100};
    int p23[5]= {139,134,119,105,234};
    int p24[5]= {87,106,89,156,110};
    int p25[5]= {83,87,171,89,83};
    int p26[5]= {77,149,81,80,131};
    int p27[5]= {91,148,135,78,78};
    int p28[5]= {140,83,87,133,87};
    int p29[5]= {78,78,145,82,146};
    int p30[5]= {83,140,89,149,83};
    int p31[5]= {166,170,114,113,134};
    int p32[5]= {83,86,153,87,128};
    int p33[5]= {190,113,182,109,106};
    int p34[5]= {363,182,192,191,330};
    int p35[5]= {156,272,316,138,156};
    int p36[5]= {141,71,162,84,81};
    int p37[5]= {88,87,137,212,89};
    int p38[5]= {180,172,193,181,150};
    int b[5]={1000,700,700,600,3000};
    int c[5]={700,700,1200,1200,3400};
    int d[5]={1200,1000,700,600,3500};
    int e[5]={1000,800,850,750,3400};
    int f[5]={500,1200,800,950,3450};
    int g[5]={1000,1000,1000,1000,4000};
    int h[5]={900,1000,600,900,3450};
    int k[5]={1200,500,1000,500,3100};
    for(int i=0; i<5; i++)
    {
        int increase=0;
        int iplus=0;
        if(cr==1)
        {
            iplus=iplus+b[i];
            increase=increase+b[4];
        }else if(cr==2)
        {
            iplus=iplus+c[i];
            increase=increase+c[4];
        }else if(cr==3)
        {
            iplus=iplus+d[i];
            increase=increase+d[4];
        }else if(cr==4)
        {
            iplus=iplus+e[i];
            increase=increase+e[4];
        }else if(cr==5)
        {
            iplus=iplus+f[i];
            increase=increase+f[4];
        }else if(cr==6)
        {
            iplus=iplus+g[i];
            increase=increase+g[4];
        }else if(cr==7)
        {
            iplus=iplus+h[i];
            increase=increase+h[4];
        }else if(cr==8)
        {
            iplus=iplus+k[i];
            increase=increase+k[4];
        }
        int sum=0;

        if(ht1==1)
        {
            sum=sum+p1[i];
        }
        else if(ht1==2)
        {
            sum=sum+p2[i];
        }
        else if(ht1==3)
        {
            sum=sum+p3[i];
        }
        else if(ht1==4)
        {
            sum=sum+p4[i];
        }
        else if(ht1==5)
        {
            sum=sum+p5[i];
        }
        else if(ht1==6)
        {
            sum=sum+p6[i];
        }
        else if(ht1==7)
        {
            sum=sum+p7[i];
        }
        else if(ht1==8)
        {
            sum=sum+p8[i];
        }
        else if(ht1==9)
        {
            sum=sum+p9[i];
        }
        else if(ht1==10)
        {
            sum=sum+p10[i];
        }
        else if(ht1==11)
        {
            sum=sum+p11[i];
        }
        else if(ht1==12)
        {
            sum=sum+p12[i];
        }
        else if(ht1==13)
        {
            sum=sum+p13[i];
        }
        else if(ht1==14)
        {
            sum=sum+p14[i];
        }
        else if(ht1==15)
        {
            sum=sum+p15[i];
        }
        else if(ht1==16)
        {
            sum=sum+p16[i];
        }
        else if(ht1==17)
        {
            sum=sum+p17[i];
        }
        else if(ht1==18)
        {
            sum=sum+p18[i];
        }
        else if(ht1==19)
        {
            sum=sum+p19[i];
        }
        else if(ht1==20)
        {
            sum=sum+p20[i];
        }
        else if(ht1==21)
        {
            sum=sum+p21[i];
        }
        else if(ht1==22)
        {
            sum=sum+p22[i];
        }
        else if(ht1==23)
        {
            sum=sum+p23[i];
        }
        else if(ht1==24)
        {
            sum=sum+p24[i];
        }
        else if(ht1==25)
        {
            sum=sum+p25[i];
        }
        else if(ht1==26)
        {
            sum=sum+p26[i];
        }
        else if(ht1==27)
        {
            sum=sum+p27[i];
        }
        else if(ht1==28)
        {
            sum=sum+p28[i];
        }
        else if(ht1==29)
        {
            sum=sum+p29[i];
        }
        else if(ht1==30)
        {
            sum=sum+p30[i];
        }
        else if(ht1==31)
        {
            sum=sum+p31[i];
        }
        else if(ht1==32)
        {
            sum=sum+p32[i];
        }
        else if(ht1==33)
        {
            sum=sum+p33[i];
        }
        else if(ht1==34)
        {
            sum=sum+p34[i];
        }
        else if(ht1==35)
        {
            sum=sum+p35[i];
        }
        else if(ht1==36)
        {
            sum=sum+p36[i];
        }
        else if(ht1==37)
        {
            sum=sum+p37[i];
        }
        else if(ht1==38)
        {
            sum=sum+p38[i];
        }


        int add=0;
        if(ht2==1)
        {
            add=add+p1[i];
        }
        else if(ht2==2)
        {
            add=add+p2[i];
        }
        else if(ht2==3)
        {
            add=add+p3[i];
        }
        else if(ht2==4)
        {
            add=add+p4[i];
        }
        else if(ht2==5)
        {
            add=add+p5[i];
        }
        else if(ht2==6)
        {
            add=add+p6[i];
        }
        else if(ht2==7)
        {
            add=add+p7[i];
        }
        else if(ht2==8)
        {
            add=add+p8[i];
        }
        else if(ht2==9)
        {
            add=add+p9[i];
        }
        else if(ht2==10)
        {
            add=add+p10[i];
        }
        else if(ht2==11)
        {
            add=add+p11[i];
        }
        else if(ht2==12)
        {
            add=add+p12[i];
        }
        else if(ht2==13)
        {
            add=add+p13[i];
        }
        else if(ht2==14)
        {
            add=add+p14[i];
        }
        else if(ht2==15)
        {
            add=add+p15[i];
        }
        else if(ht2==16)
        {
            add=add+p16[i];
        }
        else if(ht2==17)
        {
            add=add+p17[i];
        }
        else if(ht2==18)
        {
            add=add+p18[i];
        }
        else if(ht2==19)
        {
            add=add+p19[i];
        }
        else if(ht2==20)
        {
            add=add+p20[i];
        }
        else if(ht2==21)
        {
            add=add+p21[i];
        }
        else if(ht2==22)
        {
            add=add+p22[i];
        }
        else if(ht2==23)
        {
            add=add+p23[i];
        }
        else if(ht2==24)
        {
            add=add+p24[i];
        }
        else if(ht2==25)
        {
            add=add+p25[i];
        }
        else if(ht2==26)
        {
            add=add+p26[i];
        }
        else if(ht2==27)
        {
            add=add+p27[i];
        }
        else if(ht2==28)
        {
            add=add+p28[i];
        }
        else if(ht2==29)
        {
            add=add+p29[i];
        }
        else if(ht2==30)
        {
            add=add+p30[i];
        }
        else if(ht2==31)
        {
            add=add+p31[i];
        }
        else if(ht2==32)
        {
            add=add+p32[i];
        }
        else if(ht2==33)
        {
            add=add+p33[i];
        }
        else if(ht2==34)
        {
            add=add+p34[i];
        }
        else if(ht2==35)
        {
            add=add+p35[i];
        }
        else if(ht2==36)
        {
            add=add+p36[i];
        }
        else if(ht2==37)
        {
            add=add+p37[i];
        }
        else if(ht2==38)
        {
            add=add+p38[i];
        }

        if(i==0)
        {
            printf("力道:");
        }
        else if(i==1)
        {
            printf("氣勁:");
        }
        else if(i==2)
        {
            printf("根骨:");
        }
        else if(i==3)
        {
            printf("洞察:");
        }
        else if(i==4)
        {
            printf("身法:");
        }

        printf("%d + %d + %d => %d\n",sum,add,iplus,sum+add+iplus);
        if(i==4)
        {
            printf("戰力: %d",increase+sum*100+add*50);
        }
    }
}
/*void cl(int ht1,int ht2,Data data)
{
    if(ht1==1)
    {
        data.force=data.force+44;
        data.gas=data.gas+69;
        data.bone=data.bone+109;
        data.insight=data.insight+49;
        data.body=data.body+46;
    }

    if(ht2==1)
    {
        data.force=data.force+44;
        data.gas=data.gas+69;
        data.bone=data.bone+109;
        data.insight=data.insight+49;
        data.body=data.body+46;
    }
}*/
/*void listh3(int ht1,int ht2,Mode mode)
{
            printf("力道:%d",mode.data.force);
            printf("氣勁:%d",mode.data.gas);
            printf("根骨:%d",mode.data.bone);
            printf("洞察:%d",mode.data.insight);
            printf("身法:%d",mode.data.body);
}*/
void listh1(int ht1)
{
    if(ht1==1)
    {
        printf("======================================\n");
        printf("歸鞘與【14.偃師】相生,身法提升17%%\n");
        printf("歸鞘與【38.拜月冰心】相生,洞察提升18%%\n");
        printf("======================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==2)
    {
        printf("=======================================\n");
        printf("厚德與【20.善緣】相生,氣勁提升17%%\n");
        printf("厚德與【38.拜月冰心】相生,洞察提升18%%\n");
        printf("=======================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==3)
    {
        printf("====================================\n");
        printf("白刃與【25.悲回風】相生,力道提升22%%\n");
        printf("====================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==4)
    {
        printf("====================================\n");
        printf("修羅與【25.悲回風】相生,力道提升16%%\n");
        printf("修羅與【23.九嬰】相生,根骨提升18%%\n");
        printf("====================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==5)
    {
        printf("==============================================\n");
        printf("同袍與【6.征旗】相生,力道提升12%%,氣勁提升12%%\n");
        printf("同袍與【13.靈素】相生,根骨提升16%%\n");
        printf("==============================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==6)
    {
        printf("==============================================\n");
        printf("征旗與【8.金戈】相生,洞察提升17%%\n");
        printf("征旗與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
        printf("==============================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==7)
    {
        printf("==================================\n");
        printf("青鳥與【20.善緣】相生,氣勁提升20%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==8)
    {
        printf("==============================================\n");
        printf("金戈與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
        printf("金戈與【26.殺菩提】相生,身法提升16%%\n");
        printf("==============================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==9)
    {
        printf("==============================================\n");
        printf("鐵馬與【8.金戈】相生,洞察提升17%%\n");
        printf("鐵馬與【6.征旗】相生,力道提升12%%,氣勁提升10%%\n");
        printf("==============================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==10)
    {
        printf("==================================\n");
        printf("獅吼與【8.金戈】相生,洞察提升16%%\n");
        printf("獅吼與【3.白刃】相生,洞察提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==13)
    {
        printf("==================================\n");
        printf("靈素與【5.同袍】相生,洞察提升20%%\n");
        printf("靈素與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==14)
    {
        printf("==================================\n");
        printf("偃師與【1.歸鞘】相生,根骨提升18%%\n");
        printf("偃師與【15.長天】相生,身法提升16%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==25)
    {
        printf("==================================\n");
        printf("悲回風與【3.白刃】相生,洞察提升16%%\n");
        printf("悲回風與【10.獅吼】相生,氣勁提升18%%\n");
        printf("悲回風與【4.修羅】相生,力道提升15%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==15)
    {
        printf("==================================\n");
        printf("長天與【19.地藏】相生,身法提升12%%,根骨提升9%%\n");
        printf("長天與【38.拜月冰心】相生,身法提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==16)
    {
        printf("==================================\n");
        printf("速生與【26.殺菩提】相生,身法提升16%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==17)
    {
        printf("==================================\n");
        printf("饕餮與【22.無生】相生,氣勁提升12%%,力道提升9%%\n");
        printf("饕餮與【36.獵風沈舟】相生,力道提升10%%,洞察提升11%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==28)
    {
        printf("==================================\n");
        printf("淬火流毒無相生\n");
        printf("==================================\n");
    }

    else if(ht1==29)
    {
        printf("==================================\n");
        printf("風華玉碎與【15.長天】相生,力道提升11%%,洞察提升8%%\n");
        printf("風華玉碎與【23.九嬰】相生,根骨提升16%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==30)
    {
        printf("==================================\n");
        printf("煉武力道與【37.嘯天鎮岳】相生,力道提升9%%,身法提升11%%\n");
        printf("煉武力道與【36.獵風沈舟】相生,力道提升7%%,根骨提升12%%\n");
        printf("煉武力道與【9.鐵馬】相生,力道提升8%%,氣勁提升11%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==31)
    {
        printf("==================================\n");
        printf("煉武氣勁與【29.風華玉碎】相生,氣勁提升7%%,洞察提升11%%\n");
        printf("煉武氣勁與【8.金戈】相生,氣勁提升9%%,根骨提升10%%\n");
        printf("煉武氣勁與【27.羅喉訣】相生,氣勁提升8%%,力道提升10%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==32)
    {
        printf("==================================\n");
        printf("煉武根骨與【19.地藏】相生身法提升18%%\n");
        printf("煉武根骨與【21.絕命】相生,根骨提升10%%,身法提升9%%\n");
        printf("煉武根骨與【38.拜月·冰心】相生,氣勁提升11%,根骨提升9%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==33)
    {
        printf("==================================\n");
        printf("煉武洞察與【25.悲回風】相生,力道提升12%%,洞察提升8%%\n");
        printf("煉武洞察與【23.九嬰】相生,根骨提升13%%,洞察提升7%%\n");
        printf("煉武洞察與【4.修羅】相生,力道提升10%%,洞察提升8%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==34)
    {
        printf("==================================\n");
        printf("煉武身法與【28.淬火流毒】相生,根骨提升12%%,身法提升9%%\n");
        printf("煉武身法與【37.嘯天鎮岳】相生,根骨提升13%%,身法提升7%%\n");
        printf("煉武身法與【14.偃師】相生,洞察提升12%%,身法提升8%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==18)
    {
        printf("==================================\n");
        printf("尋歡無相生\n");
        printf("==================================\n");
    }
    else if(ht1==19)
    {
        printf("==================================\n");
        printf("地藏與【21.絕命】相生,根骨提升16%%\n");
        printf("地藏與【15.長天】相生,身法提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==20)
    {
        printf("==================================\n");
        printf("善緣與【2.厚德】相生,根骨提升17%%\n");
        printf("善緣與【7.青鳥】相生,氣勁提升16%%\n");
        printf("善緣與【8.金戈】相生,洞察提升17%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==21)
    {
        printf("==================================\n");
        printf("絕命與【2.厚德】相生,根骨提升17%%\n");
        printf("絕命與【14.偃師】相生,身法提升20%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==22)
    {
        printf("==================================\n");
        printf("無生與【27.羅喉訣】相生,力道提升10%%,洞察提升8%%\n");
        printf("無生與【17.饕餮】相生,根骨提升18%%\n");
        printf("無生與【15.長天】相生,身法提升16%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==11)
    {
        printf("==================================\n");
        printf("無滅與【2.厚德】相生,根骨提升17%%\n");
        printf("無滅與【12.極樂】相生,身法提升20%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==24)
    {
        printf("==================================\n");
        printf("止殺與【8.金戈】相生,洞察提升16%%\n");
        printf("止殺與【5.同袍】相生,洞察提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==27)
    {
        printf("==================================\n");
        printf("羅喉訣與【23.九嬰】相生,根骨提升15%%\n");
        printf("羅喉訣與【15.長天】相生,身法提升17%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==26)
    {
        printf("==================================\n");
        printf("殺菩提與【23.九嬰】相生根骨提升10%%,身法提升7%%\n");
        printf("殺菩提與【15.長天】相生,根骨提升10%%,身法提升10%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==36)
    {
        printf("==================================\n");
        printf("獵風沈舟與【27.羅喉訣】相生,力道提升8%%,氣勁提升12%%\n");
        printf("獵風沈舟與【22.無生】相生,力道提升10%%,洞察提升9%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==37)
    {
        printf("==================================\n");
        printf("嘯天鎮岳與【19.地藏】相生根骨提升9%%,身法提升9%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }

    else if(ht1==12)
    {
        printf("==================================\n");
        printf("極樂與【23.九嬰】相生根骨提升16%%\n");
        printf("極樂與【4.修羅】相生,力道提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==23)
    {
        printf("==================================\n");
        printf("九嬰與【27.羅喉訣】相生力道提升12%%,洞察提升9%%\n");
        printf("九嬰與【4.修羅】相生,力道提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==35)
    {
        printf("==================================\n");
        printf("刑天滄海與【4.修羅】相生力道提升10%%,身法提升6%%\n");
        printf("刑天滄海與【15.長天】相生,氣勁提升10%%,身法提升6%%\n");
        printf("刑天滄海與【25.悲回風】相生,根骨提升8%%,洞察提升8%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==38)
    {
        printf("==================================\n");
        printf("拜月冰心與【15.長天】相生身法提升18%%\n");
        printf("拜月冰心與【13.靈素】相生,根骨提升10%%,身法提升9%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
}
    void listh2(int ht2)
    {
        if(ht2==1)
        {
            printf("======================================\n");
            printf("歸鞘與【14.偃師】相生,身法提升17%%\n");
            printf("歸鞘與【38.拜月冰心】相生,洞察提升18%%\n");
            printf("======================================\n");
        }
        else if(ht2==2)
        {
            printf("======================================\n");
            printf("厚德與【20.善緣】相生,氣勁提升17%%\n");
            printf("厚德與【38.拜月冰心】相生,洞察提升18%%\n");
            printf("======================================\n");
        }
        else if(ht2==3)
        {
            printf("====================================\n");
            printf("白刃與【25.悲回風】相生,力道提升22%%\n");
            printf("====================================\n");
        }
        else if(ht2==4)
        {
            printf("====================================\n");
            printf("修羅與【25.悲回風】相生,力道提升16%%\n");
            printf("修羅與【23.九嬰】相生,根骨提升18%%\n");
            printf("====================================\n");
        }
        else if(ht2==5)
        {
            printf("==============================================\n");
            printf("同袍與【6.征旗】相生,力道提升12%%,氣勁提升12%%\n");
            printf("同袍與【13.靈素】相生,根骨提升16%%\n");
            printf("==============================================\n");
        }
        else if(ht2==6)
        {
            printf("==============================================\n");
            printf("征旗與【8.金戈】相生,洞察提升17%%\n");
            printf("征旗與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
            printf("==============================================\n");
        }
        else if(ht2==7)
        {
            printf("==================================\n");
            printf("青鳥與【20.善緣】相生,氣勁提升20%%\n");
            printf("==================================\n");
        }
        else if(ht2==8)
        {
            printf("==============================================\n");
            printf("金戈與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
            printf("金戈與【26.殺菩提】相生,身法提升16%%\n");
            printf("==============================================\n");
        }
        else if(ht2==9)
        {
            printf("==============================================\n");
            printf("鐵馬與【8.金戈】相生,洞察提升17%%\n");
            printf("鐵馬與【6.征旗】相生,力道提升12%%,氣勁提升10%%\n");
            printf("=========================================】=====\n");
        }
        else if(ht2==10)
        {
            printf("==================================\n");
            printf("獅吼與【8.金戈】相生,洞察提升16%%\n");
            printf("獅吼與【3.白刃】相生,洞察提升18%%\n");
            printf("==================================\n");
        }
        else if(ht2==13)
    {
        printf("==================================\n");
        printf("靈素與【5.同袍】相生,洞察提升20%%\n");
        printf("靈素與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==14)
    {
        printf("==================================\n");
        printf("偃師與【1.歸鞘】相生,根骨提升18%%\n");
        printf("偃師與【15.長天】相生,身法提升16%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==25)
    {
        printf("==================================\n");
        printf("悲回風與【3.白刃】相生,洞察提升16%%\n");
        printf("悲回風與【10.獅吼】相生,氣勁提升18%%\n");
        printf("悲回風與【4.修羅】相生,力道提升15%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==15)
    {
        printf("==================================\n");
        printf("長天與【19.地藏】相生,身法提升12%%,根骨提升9%%\n");
        printf("長天與【38.拜月冰心】相生,身法提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==16)
    {
        printf("==================================\n");
        printf("速生與【26.殺菩提】相生,身法提升16%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==17)
    {
        printf("==================================\n");
        printf("饕餮與【22.無生】相生,氣勁提升12%%,力道提升9%%\n");
        printf("饕餮與【36.獵風沈舟】相生,力道提升10%%,洞察提升11%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==28)
    {
        printf("==================================\n");
        printf("淬火流毒無相生\n");
        printf("==================================\n");
    }

    else if(ht2==29)
    {
        printf("==================================\n");
        printf("風華玉碎與【15.長天】相生,力道提升11%%,洞察提升8%%\n");
        printf("風華玉碎與【23.九嬰】相生,根骨提升16%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==30)
    {
        printf("==================================\n");
        printf("煉武力道與【37.嘯天鎮岳】相生,力道提升9%%,身法提升11%%\n");
        printf("煉武力道與【36.獵風沈舟】相生,力道提升7%%,根骨提升12%%\n");
        printf("煉武力道與【9.鐵馬】相生,力道提升8%%,氣勁提升11%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==31)
    {
        printf("==================================\n");
        printf("煉武氣勁與【29.風華玉碎】相生,氣勁提升7%%,洞察提升11%%\n");
        printf("煉武氣勁與【8.金戈】相生,氣勁提升9%%,根骨提升10%%\n");
        printf("煉武氣勁與【27.羅喉訣】相生,氣勁提升8%%,力道提升10%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==32)
    {
        printf("==================================\n");
        printf("煉武根骨與【19.地藏】相生身法提升18%%\n");
        printf("煉武根骨與【21.絕命】相生,根骨提升10%%,身法提升9%%\n");
        printf("煉武根骨與【38.拜月·冰心】相生,氣勁提升11%,根骨提升9%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==33)
    {
        printf("==================================\n");
        printf("煉武洞察與【25.悲回風】相生,力道提升12%%,洞察提升8%%\n");
        printf("煉武洞察與【23.九嬰】相生,根骨提升13%%,洞察提升7%%\n");
        printf("煉武洞察與【4.修羅】相生,力道提升10%%,洞察提升8%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==34)
    {
        printf("==================================\n");
        printf("煉武身法與【28.淬火流毒】相生,根骨提升12%%,身法提升9%%\n");
        printf("煉武身法與【37.嘯天鎮岳】相生,根骨提升13%%,身法提升7%%\n");
        printf("煉武身法與【14.偃師】相生,洞察提升12%%,身法提升8%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==18)
    {
        printf("==================================\n");
        printf("尋歡無相生\n");
        printf("==================================\n");
    }
    else if(ht2==19)
    {
        printf("==================================\n");
        printf("地藏與【21.絕命】相生,根骨提升16%%\n");
        printf("地藏與【15.長天】相生,身法提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==20)
    {
        printf("==================================\n");
        printf("善緣與【2.厚德】相生,根骨提升17%%\n");
        printf("善緣與【7.青鳥】相生,氣勁提升16%%\n");
        printf("善緣與【8.金戈】相生,洞察提升17%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==21)
    {
        printf("==================================\n");
        printf("絕命與【2.厚德】相生,根骨提升17%%\n");
        printf("絕命與【14.偃師】相生,身法提升20%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==22)
    {
        printf("==================================\n");
        printf("無生與【27.羅喉訣】相生,力道提升10%%,洞察提升8%%\n");
        printf("無生與【17.饕餮】相生,根骨提升18%%\n");
        printf("無生與【15.長天】相生,身法提升16%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==11)
    {
        printf("==================================\n");
        printf("無滅與【2.厚德】相生,根骨提升17%%\n");
        printf("無滅與【12.極樂】相生,身法提升20%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==24)
    {
        printf("==================================\n");
        printf("止殺與【8.金戈】相生,洞察提升16%%\n");
        printf("止殺與【5.同袍】相生,洞察提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==27)
    {
        printf("==================================\n");
        printf("羅喉訣與【23.九嬰】相生,根骨提升15%%\n");
        printf("羅喉訣與【15.長天】相生,身法提升17%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==26)
    {
        printf("==================================\n");
        printf("殺菩提與【23.九嬰】相生根骨提升10%%,身法提升7%%\n");
        printf("殺菩提與【15.長天】相生,根骨提升10%%,身法提升10%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==36)
    {
        printf("==================================\n");
        printf("獵風沈舟與【27.羅喉訣】相生,力道提升8%%,氣勁提升12%%\n");
        printf("獵風沈舟與【22.無生】相生,力道提升10%%,洞察提升9%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==37)
    {
        printf("==================================\n");
        printf("嘯天鎮岳與【19.地藏】相生根骨提升9%%,身法提升9%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }

    else if(ht2==12)
    {
        printf("==================================\n");
        printf("極樂與【23.九嬰】相生根骨提升16%%\n");
        printf("極樂與【4.修羅】相生,力道提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==23)
    {
        printf("==================================\n");
        printf("九嬰與【27.羅喉訣】相生力道提升12%%,洞察提升9%%\n");
        printf("九嬰與【4.修羅】相生,力道提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==35)
    {
        printf("==================================\n");
        printf("刑天滄海與【4.修羅】相生力道提升10%%,身法提升6%%\n");
        printf("刑天滄海與【15.長天】相生,氣勁提升10%%,身法提升6%%\n");
        printf("刑天滄海與【25.悲回風】相生,根骨提升8%%,洞察提升8%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==38)
    {
        printf("==================================\n");
        printf("拜月冰心與【15.長天】相生身法提升18%%\n");
        printf("拜月冰心與【13.靈素】相生,根骨提升10%%,身法提升9%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    }
    int main()
    {
        Mode mode;
        int cr=0,ht1=0,ht2=0;
        char choose='N';
        while(choose=='N')
        {
            printf("=========================天涯八荒八大門派============================\n");
            printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
            printf("|【**1.太白**】||【**2.神威**】||【**3.神刀**】||【**4.真武**】    |\n");
            printf("|【**5.五毒**】||【**6.丐幫**】||【**7.天香**】||【**8.唐門**】    |\n");
            printf("]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");
            printf("======>選擇職業\n");
            printf("卍");
            scanf("%d",&cr);

            char select='N';
            while(select=='N')
            {
                printf("\n");
                printf("=========================精通各路心法經脈============================\n");
                printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
                printf("|【1.歸鞘】【2.厚德】【3.白刃】【4.修羅】【5.同袍】【6.征旗】      |\n");
                printf("|【7.青鳥】【8.金戈】【9.鐵馬】【10.獅吼】【11.無滅】【12.極樂】   |\n");
                printf("|【13.靈素】【14.偃師】【15.長天】【16.速生】【17.饕餮】【18.尋歡】|\n");
                printf("|【19.地藏】【20.善緣】【21.絕命】【22.無生】【23.九嬰】【24.止殺】|\n");
                printf("|【25.悲回風】【26.殺菩提】【27.羅喉訣】                           |\n");
                printf("|【28.淬火流毒】【29.風華玉碎】【30.煉武力道】【31.煉武氣勁】      |\n");
                printf("|【32.煉武根骨】【33.煉武洞察】【34.煉武身法】【35.刑天滄海】      |\n");
                printf("|【36.獵風沈舟】【37.嘯天鎮岳】【38.拜月冰心】                     |\n");
                printf("]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");
                printf("======>選擇心法\n");
                printf("卍");
                scanf("%d",&ht1);
                listh1(ht1);
                printf("卍");
                scanf("%d",&ht2);
                listh2(ht2);
                printf("已選擇:%d %d 心法，是否確定繼續計算，否，則跳回主選單?(Y/N)\n", ht1, ht2);
                printf("卍");
                getchar();
                select =toupper(getchar());
            }

            printf("\n==========角色資料框==========\n");
            printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
            prarr(cr,ht1,ht2);
            printf("---------------------------\n");
            list3(ht1,ht2,cr);
            printf("\n]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");


            printf("是否結束遊戲?，否，則跳回主選單(Y/N)\n");
            getchar();
            choose=toupper(getchar());
        }
        return 0;
    }
