#include<stdio.h>
#include <stdlib.h>
void prarr(int cr,int ht1,int ht2)
{
    if(cr==1)
        printf("腳色職業:【**太白**】");
    else if(cr==2)
        printf("腳色職業:【**神威**】");
    else if(cr==3)
        printf("腳色職業:【**神刀**】");
    else if(cr==4)
        printf("腳色職業:【**真武**】");
    else if(cr==5)
        printf("腳色職業:【**五毒**】");
    else if(cr==6)
        printf("腳色職業:【**丐幫**】");
    else if(cr==7)
        printf("腳色職業:【**天香**】");
    else if(cr==8)
        printf("腳色職業:【**唐門**】");
    printf("\n");
    if(ht1==1)
        printf("心法刻印:【歸鞘】");
    else if(ht1==2)
        printf("心法刻印:【厚德】");
    else if(ht1==3)
        printf("心法刻印:【白刃】");
    else if(ht1==4)
        printf("心法刻印:【修羅】");
    else if(ht1==5)
        printf("心法刻印:【同袍】");
    else if(ht1==6)
        printf("心法刻印:【征旗】");
    else if(ht1==7)
        printf("心法刻印:【青鳥】");
    else if(ht1==8)
        printf("心法刻印:【金戈】");
    else if(ht1==9)
        printf("心法刻印:【鐵馬】");
    else if(ht1==10)
        printf("心法刻印:【獅吼】");

    if(ht2==1)
        printf("【歸鞘】");
    else if(ht2==2)
        printf("【厚德】");
    else if(ht2==3)
        printf("【白刃】");
    else if(ht2==4)
        printf("【修羅】");
    else if(ht2==5)
        printf("【同袍】");
    else if(ht2==6)
        printf("【征旗】");
    else if(ht2==7)
        printf("【青鳥】");
    else if(ht2==8)
        printf("【金戈】");
    else if(ht2==9)
        printf("【鐵馬】");
    else if(ht2==10)
        printf("【獅吼】");
}
void listh1(int ht1)
{
    if(ht1==1)
    {
        printf("==================================\n");
        printf("歸鞘與【偃師】相生,身法提升17%\n");
        printf("歸鞘與【拜月冰心】相生,洞察提升18%\n");
        printf("==================================\n");
    }else if(ht1==2){
        printf("==================================\n");
        printf("厚德與【善緣】相生,氣勁提升17%\n");
        printf("厚德與【拜月冰心】相生,洞察提升18%\n");
        printf("==================================\n");
    }else if(ht1==3){
        printf("==================================\n");
        printf("白刃與【悲回風】相生,力道提升22%\n");
        printf("==================================\n");
    }else if(ht1==4){
        printf("==================================\n");
        printf("修羅與【悲回風】相生,力道提升16%\n");
        printf("修羅與【九嬰】相生,根骨提升18%\n");
        printf("==================================\n");
    }else if(ht1==5){
        printf("==========================================\n");
        printf("同袍與【征旗】相生,力道提升12%,氣勁提升12%\n");
        printf("同袍與【靈素】相生,根骨提升16%\n");
        printf("==========================================\n");
    }else if(ht1==6){
        printf("==========================================\n");
        printf("征旗與【金戈】相生,洞察提升17%\n");
        printf("征旗與【鐵馬】相生,力道提升12%,氣勁提升10%\n");
        printf("==========================================\n");
    }else if(ht1==7){
        printf("==================================\n");
        printf("青鳥與【善緣】相生,氣勁提升20%\n");
        printf("==================================\n");
    }else if(ht1==8){
        printf("==========================================\n");
        printf("金戈與【鐵馬】相生,力道提升12%,氣勁提升10%\n");
        printf("金戈與【殺菩提】相生,身法提升16%\n");
        printf("==========================================\n");
    }else if(ht1==9){
        printf("==========================================\n");
        printf("鐵馬與【金戈】相生,洞察提升17%\n");
        printf("鐵馬與【征旗】相生,力道提升12%,氣勁提升10%\n");
        printf("==========================================\n");
    }else if(ht1==10){
        printf("==================================\n");
        printf("獅吼與【金戈】相生,洞察提升16%\n");
        printf("獅吼與【白刃】相生,洞察提升18%\n");
        printf("==================================\n");
    }
}
void listh2(int ht2)
{
    if(ht2==1)
    {
        printf("==================================\n");
        printf("歸鞘與【偃師】相生,身法提升17%\n");
        printf("歸鞘與【拜月冰心】相生,洞察提升18%\n");
        printf("==================================\n");
    }else if(ht2==2){
        printf("==================================\n");
        printf("厚德與【善緣】相生,氣勁提升17%\n");
        printf("厚德與【拜月冰心】相生,洞察提升18%\n");
        printf("==================================\n");
    }else if(ht2==3){
        printf("==================================\n");
        printf("白刃與【悲回風】相生,力道提升22%\n");
        printf("==================================\n");
    }else if(ht2==4){
        printf("==================================\n");
        printf("修羅與【悲回風】相生,力道提升16%\n");
        printf("修羅與【九嬰】相生,根骨提升18%\n");
        printf("==================================\n");
    }else if(ht2==5){
        printf("==========================================\n");
        printf("同袍與【征旗】相生,力道提升12%,氣勁提升12%\n");
        printf("同袍與【靈素】相生,根骨提升16%\n");
        printf("==========================================\n");
    }else if(ht2==6){
        printf("==========================================\n");
        printf("征旗與【金戈】相生,洞察提升17%\n");
        printf("征旗與【鐵馬】相生,力道提升12%,氣勁提升10%\n");
        printf("==========================================\n");
    }else if(ht2==7){
        printf("==================================\n");
        printf("青鳥與【善緣】相生,氣勁提升20%\n");
        printf("==================================\n");
    }else if(ht2==8){
        printf("==========================================\n");
        printf("金戈與【鐵馬】相生,力道提升12%,氣勁提升10%\n");
        printf("金戈與【殺菩提】相生,身法提升16%\n");
        printf("==========================================\n");
    }else if(ht2==9){
        printf("==========================================\n");
        printf("鐵馬與【金戈】相生,洞察提升17%\n");
        printf("鐵馬與【征旗】相生,力道提升12%,氣勁提升10%\n");
        printf("==========================================\n");
    }else if(ht2==10){
        printf("==================================\n");
        printf("獅吼與【金戈】相生,洞察提升16%\n");
        printf("獅吼與【白刃】相生,洞察提升18%\n");
        printf("==================================\n");
    }
}
int main()
{
int cr=0,ht1=0,ht2=0;
    printf("====================天涯八荒八大門派====================\n");
    printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
    printf("|【**太白**】||【**神威**】||【**神刀**】||【**真武**】|\n");
    printf("|【**五毒**】||【**丐幫**】||【**天香**】||【**唐門**】|\n");
    printf("]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");
    printf("======>選擇職業\n");
    printf("卍");
    scanf("%d",&cr);

    printf("=================精通各路心法經脈=================\n");
    printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
    printf("|【歸鞘】【厚德】【白刃】【修羅】【同袍】【征旗】|\n");
    printf("|【青鳥】【金戈】【鐵馬】【獅吼】【無滅】【極樂】|\n");
    printf("|【靈素】【偃師】【長天】【速生】【饕餮】【尋歡】|\n");
    printf("|【地藏】【善緣】【絕命】【無生】【九嬰】【止殺】|\n");
    printf("|【悲回風】【殺菩提】【羅喉訣】                  |\n");
    printf("|【淬火流毒】【風華玉碎】【煉武力道】【煉武氣勁】|\n");
    printf("|【煉武根骨】【煉武洞察】【煉武身法】【刑天滄海】|\n");
    printf("|【獵風沉舟】【嘯天鎮岳】【拜月冰心】            |\n");
    printf("]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");
    printf("======>選擇心法\n");
    printf("卍");
scanf("%d",&ht1);
    listh1(ht1);
    printf("卍");
scanf("%d",&ht2);
    listh2(ht2);
return 0;
}

