#include<stdio.h>
#include <stdlib.h>
#include <ctype.h>
void prarr(int cr,int ht1,int ht2)
{
    if(cr==1)
        printf("腳色職業:【**太白**】");
    else if(cr==2)
        printf("腳色職業:【**神威**】");
    else if(cr==3)
        printf("腳色職業:【**神刀**】");
    else if(cr==4)
        printf("腳色職業:【**真武**】");
    else if(cr==5)
        printf("腳色職業:【**五毒**】");
    else if(cr==6)
        printf("腳色職業:【**丐幫**】");
    else if(cr==7)
        printf("腳色職業:【**天香**】");
    else if(cr==8)
        printf("腳色職業:【**唐門**】");
    printf("\n");
    if(ht1==1)
        printf("心法刻印:【歸鞘】");
    else if(ht1==2)
        printf("心法刻印:【厚德】");
    else if(ht1==3)
        printf("心法刻印:【白刃】");
    else if(ht1==4)
        printf("心法刻印:【修羅】");
    else if(ht1==5)
        printf("心法刻印:【同袍】");
    else if(ht1==6)
        printf("心法刻印:【征旗】");
    else if(ht1==7)
        printf("心法刻印:【青鳥】");
    else if(ht1==8)
        printf("心法刻印:【金戈】");
    else if(ht1==9)
        printf("心法刻印:【鐵馬】");
    else if(ht1==10)
        printf("心法刻印:【獅吼】");

    if(ht2==1)
        printf("【歸鞘】");
    else if(ht2==2)
        printf("【厚德】");
    else if(ht2==3)
        printf("【白刃】");
    else if(ht2==4)
        printf("【修羅】");
    else if(ht2==5)
        printf("【同袍】");
    else if(ht2==6)
        printf("【征旗】");
    else if(ht2==7)
        printf("【青鳥】");
    else if(ht2==8)
        printf("【金戈】");
    else if(ht2==9)
        printf("【鐵馬】");
    else if(ht2==10)
        printf("【獅吼】");
}
void listh1(int ht1)
{
    if(ht1==1)
    {
        printf("====================================\n");
        printf("歸鞘與【14.偃師】相生,身法提升17%%\n");
        printf("歸鞘與【38.拜月冰心】相生,洞察提升18%%\n");
        printf("====================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==2)
    {
        printf("====================================\n");
        printf("厚德與【20.善緣】相生,氣勁提升17%%\n");
        printf("厚德與【38.拜月冰心】相生,洞察提升18%%\n");
        printf("====================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==3)
    {
        printf("==================================\n");
        printf("白刃與【25.悲回風】相生,力道提升22%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==4)
    {
        printf("==================================\n");
        printf("修羅與【25.悲回風】相生,力道提升16%%\n");
        printf("修羅與【23.九嬰】相生,根骨提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==5)
    {
        printf("============================================\n");
        printf("同袍與【6.征旗】相生,力道提升12%%,氣勁提升12%%\n");
        printf("同袍與【13.靈素】相生,根骨提升16%%\n");
        printf("============================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==6)
    {
        printf("==========================================\n");
        printf("征旗與【8.金戈】相生,洞察提升17%%\n");
        printf("征旗與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
        printf("==========================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==7)
    {
        printf("==================================\n");
        printf("青鳥與【20.善緣】相生,氣勁提升20%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==8)
    {
        printf("==========================================\n");
        printf("金戈與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
        printf("金戈與【26.殺菩提】相生,身法提升16%%\n");
        printf("==========================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==9)
    {
        printf("==========================================\n");
        printf("鐵馬與【8.金戈】相生,洞察提升17%%\n");
        printf("鐵馬與【6.征旗】相生,力道提升12%%,氣勁提升10%%\n");
        printf("==========================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht1==10)
    {
        printf("==================================\n");
        printf("獅吼與【8.金戈】相生,洞察提升16%%\n");
        printf("獅吼與【3.白刃】相生,洞察提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
}
void listh2(int ht2)
{
    if(ht2==1)
    {
        printf("==================================\n");
        printf("歸鞘與【14.偃師】相生,身法提升17%%\n");
        printf("歸鞘與【38.拜月冰心】相生,洞察提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==2)
    {
        printf("==================================\n");
        printf("厚德與【20.善緣】相生,氣勁提升17%%\n");
        printf("厚德與【38.拜月冰心】相生,洞察提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==3)
    {
        printf("==================================\n");
        printf("白刃與【25.悲回風】相生,力道提升22%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==4)
    {
        printf("==================================\n");
        printf("修羅與【25.悲回風】相生,力道提升16%%\n");
        printf("修羅與【23.九嬰】相生,根骨提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==5)
    {
        printf("==========================================\n");
        printf("同袍與【6.征旗】相生,力道提升12%%,氣勁提升12%%\n");
        printf("同袍與【13.靈素】相生,根骨提升16%%\n");
        printf("==========================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==6)
    {
        printf("==========================================\n");
        printf("征旗與【8.金戈】相生,洞察提升17%%\n");
        printf("征旗與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
        printf("==========================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==7)
    {
        printf("==================================\n");
        printf("青鳥與【20.善緣】相生,氣勁提升20%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==8)
    {
        printf("==========================================\n");
        printf("金戈與【9.鐵馬】相生,力道提升12%%,氣勁提升10%%\n");
        printf("金戈與【26.殺菩提】相生,身法提升16%%\n");
        printf("==========================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==9)
    {
        printf("==========================================\n");
        printf("鐵馬與【8.金戈】相生,洞察提升17%%\n");
        printf("鐵馬與【6.征旗】相生,力道提升12%%,氣勁提升10%%\n");
        printf("==========================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
    else if(ht2==10)
    {
        printf("==================================\n");
        printf("獅吼與【8.金戈】相生,洞察提升16%%\n");
        printf("獅吼與【3.白刃】相生,洞察提升18%%\n");
        printf("==================================\n");
        printf("是否選擇建議心法?(是直接選擇編號)\n");
    }
}
int main()
{
    int cr=0,ht1=0,ht2=0;
    char choose='Y';
    while(choose=='Y')
    {
        printf("=========================天涯八荒八大門派============================\n");
        printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
        printf("|【**1.太白**】||【**2.神威**】||【**3.神刀**】||【**4.真武**】    |\n");
        printf("|【**5.五毒**】||【**6.丐幫**】||【**7.天香**】||【**8.唐門**】    |\n");
        printf("]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");
        printf("======>選擇職業\n");
        printf("卍");
        scanf("%d",&cr);

        char select='N';
        while(select=='N')
        {
            printf("=========================精通各路心法經脈============================\n");
            printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
            printf("|【1.歸鞘】【2.厚德】【3.白刃】【4.修羅】【5.同袍】【6.征旗】      |\n");
            printf("|【7.青鳥】【8.金戈】【9.鐵馬】【10.獅吼】【11.無滅】【12.極樂】   |\n");
            printf("|【13.靈素】【14.偃師】【15.長天】【16.速生】【17.饕餮】【18.尋歡】|\n");
            printf("|【19.地藏】【20.善緣】【21.絕命】【22.無生】【23.九嬰】【24.止殺】|\n");
            printf("|【25.悲回風】【26.殺菩提】【27.羅喉訣】                           |\n");
            printf("|【28.淬火流毒】【29.風華玉碎】【30.煉武力道】【31.煉武氣勁】      |\n");
            printf("|【32.煉武根骨】【33.煉武洞察】【34.煉武身法】【35.刑天滄海】      |\n");
            printf("|【36.獵風沉舟】【37.嘯天鎮岳】【38.拜月冰心】                     |\n");
            printf("]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");
            printf("======>選擇心法\n");
            printf("卍");
            scanf("%d",&ht1);
            listh1(ht1);
            printf("卍");
            scanf("%d",&ht2);
            listh2(ht2);
            printf("已選擇:%d %d 心法，是否確定繼續計算，否，則跳回主選單?(Y/N)\n", ht1, ht2);
            getchar();
            select =toupper(getchar());
            printf("輸入戰力: ");
        }
        printf("是否結束遊戲?，否，則跳回主選單(Y/N)\n");
        getchar();
        select =toupper(getchar());
        }
    return 0;
}

