    printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
    printf("|【**太白**】||【**神威**】||【**神刀**】||【**真武**】|\n");
    printf("|【**五毒**】||【**丐幫**】||【**天香**】||【**唐門**】|\n");
    printf("]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");
    
    
    printf("]︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷︷[\n");
    printf("|【歸鞘】【厚德】【白刃】【修羅】【同袍】【征旗】|\n");
    printf("|【青鳥】【金戈】【鐵馬】【獅吼】【無滅】【極樂】|\n");
    printf("|【靈素】【偃師】【長天】【速生】【饕餮】【尋歡】|\n");
    printf("|【地藏】【善緣】【絕命】【無生】【九嬰】【止殺】|\n");
    printf("|【悲回風】【殺菩提】【羅喉訣】                  |\n");
    printf("|【淬火流毒】【風華玉碎】【煉武力道】【煉武氣勁】|\n");
    printf("|【煉武根骨】【煉武洞察】【煉武身法】【刑天滄海】|\n");
    printf("|【獵風沉舟】【嘯天鎮岳】【拜月冰心】            |\n");
    printf("]︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸︸[\n");
