歸鞘
===========================
歸鞘與偃師相生,身法提升17%
歸鞘與拜月·冰心相生,洞察提升18%
===========================
{ 力道+44 气劲+69 根骨+109
 洞察+49 身法+46
 外功攻击+0 内功攻击+0
 外功防御+59 内功防御+24
 命中率+0% 格挡+4.515% 会心率+0%
 气血+1169 韧劲+0% 会心伤害+0% }
 .
厚德
 ==========================
 厚德與善缘相生,氣勁提升17%
 厚德與拜月·冰心相生,洞察提升18%
 ==========================
 { 力道+44 气劲+151 根骨+87
   洞察+44 身法+44 
   外功攻击+0 内功攻击+0
   外功防御+0 内功防御+55
   命中率+0% 格挡+0% 会心率+0%
   气血+814 韧劲+0.27% 会心伤害+0% }
  .
白刃
 ==========================
 白刃與悲回風相生,力道提升22%
 =========================
 { 力道+82 气劲+90 根骨+80
   洞察+72 身法+57
   外功攻击+61 内功攻击+0  
   外功防御+23 内功防御+0
   命中率+6.555% 格挡+0% 会心率+0.21%
   气血+230 韧劲+0% 会心伤害+0% }
   .
修羅
  ========================
  修羅與悲回風相生,力道提升16%
  修羅與九嬰相生,根骨提升18%
  ========================
  { 力道+114 气劲+89 根骨+87
    洞察+184 身法+100
    外功攻击+0 内功攻击+0
    外功防御+0 内功防御+0
    命中率+9.36% 格挡+0% 会心率+3.21%
    气血+230 韧劲+0% 会心伤害+7.06% }
  .
同袍
  =========================
  同袍與征旗相生,力道提升12%,氣勁提升12%
  同袍與靈素相生,根骨提升16%
  =========================
  { 力道+149 气劲+87 根骨+84
    洞察+67 身法+172
    外功攻击+0 内功攻击+0
    外功防御+92 内功防御+41
    命中率+0.375% 格挡+6.255% 会心率+0%
    气血+830 韧劲+0% 会心伤害+0% }
征旗
  =========================
  征旗與金戈相生,洞察提升17%
  征旗與鐵馬相生,力道提升12%,氣勁提升10%
  =========================
  { 力道+100 气劲+103 根骨+52
    洞察+105 身法+72
    外功攻击+10 内功攻击+8
    外功防御+0 内功防御+0 }
  .
 青鳥
   ========================
   青鳥與善缘相生,氣勁提升20%
   ========================
   { 力道+99 气劲+103 根骨+78
     洞察+89 身法+161
     外功攻击+0 内功攻击+0
     外功防御+93 内功防御+121 }
  .
 金戈
   ========================
   金戈與鐵馬相生,力道提升12%,氣勁提升10%
   金戈與殺菩提相生,身法提升16%
   ========================
   { 力道+105 气劲+120 根骨+133
     洞察+80 身法+78
     外功攻击+33 内功攻击+19
     外功防御+0 内功防御+0 }
  .
 鐵馬
   ========================
   鐵馬與金戈相生,洞察提升17%（已相生）
   鐵馬與征旗相生,力道提升12%,氣勁提升10%
   ========================
   { 力道+150 气劲+125 根骨+99
     洞察+97 身法+110
     外功攻击+60 内功攻击+14
     外功防御+0 内功防御+0 }
  .   
 獅吼
   ========================
   狮吼與金戈相生,洞察提升16%
   狮吼與白刃相生,洞察提升18%
   ========================
   { 力道+116 气劲+139 根骨+105
     洞察+114 身法+107
     外功攻击+62 内功攻击+13
     外功防御+0 内功防御+0 }
  .
 靈素
   ========================
   靈素與同袍相生,洞察提升20%
   靈素與鐵馬相生,力道提升12%,氣勁提升10%
   ========================
   { 力道+98 气劲+96 根骨+144
     洞察+82 身法+130
     外功攻击+0 内功攻击+0
     外功防御+79 内功防御+98 }
  .
 偃師
   ========================
   偃師與歸鞘相生,根骨提升18%
   偃師與長天相生,身法提升16%
   ========================
   { 力道+126 气劲+100 根骨+106
     洞察+163 身法+156
     外功攻击+0 内功攻击+0
     外功防御+0 内功防御+0 }
  .
 悲回風
   =========================
   悲回風與白刃相生,洞察提升16%
   悲回風與狮吼相生,氣勁提升18%
   悲回風與修羅相生,力道提升15%
   =========================
   { 力道+205 气劲+104 根骨+98
     洞察+180 身法+131
     外功攻击+127 内功攻击+10
     外功防御+0 内功防御+0 }
  .
 長天
   =========================
   長天與地藏相生,身法提升12%,根骨提升9%
   長天與拜月·冰心相生,身法提升18%
   =========================
   { 力道+67 气劲+60 根骨+85
     洞察+66 身法+124
     外功攻击+0 内功攻击+0
     外功防御+125 内功防御+110 }
  .
 速生
   =========================
   速生與殺菩提相生,身法提升16%
   =========================
   { 力道+93 气劲+152 根骨+75
     洞察+82 身法+133
     外功攻击+23 内功攻击+24
     外功防御+0 内功防御+0 }
  .
 饕餮
   =========================
   饕餮與無生相生,氣勁提升12%,力道提升9%
   饕餮與獵風·沉舟相生,力道提升10%,洞察提升11%
   =========================
   { 力道+156 气劲+79 根骨+78
     洞察+91 身法+113
     外功攻击+53 内功攻击+11
     外功防御+64 内功防御+0 }
  .
 淬火。流毒
   =========================
   淬火·流毒與相生,提升0%
   =========================
   { 力道+104 气劲+98 根骨+101
     洞察+169 身法+195
     外功攻击+63 内功攻击+35
     外功防御+0 内功防御+0 }
  .
 風華。玉碎
   =========================
   風華·玉碎與長天相生,力道提升11%,洞察提升8%
   風華·玉碎與九嬰相生,根骨提升16%
   =========================
  { 力道+116 气劲+212 根骨+121
  洞察+155 身法+120
  外功攻击+37 内功攻击+29
  外功防御+0 内功防御+0 }
  . 
 
