煉武。力道
=============================================
煉武·力道與嘯天·鎮岳相生,力道提升9%,身法提升11%
煉武·力道與獵風·沉舟相生,力道提升7%,根骨提升12%
煉武·力道與鐵馬相生,力道提升8%,氣勁提升11%
=============================================
力道+271  气劲+144 根骨+123  洞察+133
身法+139  
外功攻击+62 内功攻击+11
外功防御+23 内功防御+0
  
煉武。氣勁  
==============================================
煉武·氣勁與風華·玉碎相生,氣勁提升7%,洞察提升11%
煉武·氣勁與金戈相生,氣勁提升9%,根骨提升10%
煉武·氣勁與羅睺訣相生,氣勁提升8%,力道提升10%
==============================================
力道+105 气劲+209 根骨+140
洞察+111 身法+111 
外功攻击+23 内功攻击+34 
外功防御+0 内功防御+74
  
煉武。根骨
==============================================
煉武·根骨與地藏相生,根骨提升8%,身法提升10%
煉武·根骨與绝命相生,氣勁提升10%,根骨提升8%
煉武·根骨與拜月·冰心相生,氣勁提升11%,根骨提升9%
==============================================
力道+114 气劲+115 根骨+227
洞察+91 身法+91
外功攻击+0 内功攻击+0
外功防御+138 内功防御+193

煉武。洞察
=============================================
煉武·洞察與悲回風相生,力道提升12%,洞察提升8%
煉武·洞察與九嬰相生,根骨提升13%,洞察提升7%
煉武·洞察與修羅相生,力道提升10%,洞察提升8%
=============================================
力道+119 气劲+111 根骨+88
洞察+229 身法+100
外功攻击+56 内功攻击+38
外功防御+0 内功防御+0

煉武。身法
=============================================
煉武·身法與淬火·流毒相生,根骨提升12%,身法提升9%
煉武·身法與嘯天·鎮岳相生,根骨提升13%,身法提升7%
煉武·身法與偃師相生,洞察提升12%,身法提升8%
=============================================
力道+139 气劲+134 根骨+119
洞察+105 身法+234
外功攻击+0 内功攻击+0
外功防御+98 内功防御+80

尋歡
=========================================
尋歡與相生,提升0%
=========================================
力道+87 气劲+106 根骨+89
洞察+156 身法+110
外功攻击+47 内功攻击+24
外功防御+0 内功防御+0

地藏
===========================================
地藏與絕命相生,根骨提升16%
地藏與長天相生,身法提升18%
===========================================
力道+83 气劲+87 根骨+171
洞察+89 身法+83
外功攻击+0 内功攻击+8
外功防御+105 内功防御+87

無生
============================================
無生與羅睺訣相生,力道提升10%,洞察提升8%
無生與饕餮相生,根骨提升18%
無生與長天相生,身法提升16%
============================================
力道+140 气劲+83 根骨+87
洞察+133 身法+87
外功攻击+94 内功攻击+19
外功防御+0 内功防御+0

無滅
==========================================
無滅與厚德相生,根骨提升17%
無滅與極樂相生,身法提升20%
==========================================
























