煉武。力道
=============================================
煉武·力道與嘯天·鎮岳相生,力道提升9%,身法提升11%
煉武·力道與獵風·沉舟相生,力道提升7%,根骨提升12%
煉武·力道與鐵馬相生,力道提升8%,氣勁提升11%
=============================================
力道+271  气劲+144 根骨+123  洞察+133
身法+139  
外功攻击+62 内功攻击+11
外功防御+23 内功防御+0
命中率+7.695% 格挡+0%
会心率+2.18% 气血+0  
韧劲+0% 会心伤害+2.52%
  
煉武。氣勁  
==============================================
煉武·氣勁與風華·玉碎相生,氣勁提升7%,洞察提升11%
煉武·氣勁與金戈相生,氣勁提升9%,根骨提升10%
煉武·氣勁與羅睺訣相生,氣勁提升8%,力道提升10%
==============================================
力道+105 气劲+209 根骨+140
洞察+111 身法+111 
外功攻击+23 内功攻击+34 
外功防御+0 内功防御+74
命中率+7.635% 格挡+0% 会心率+3.11%
气血+282 韧劲+0% 会心伤害+6.04%
  
煉武。根骨
==============================================
煉武·根骨與地藏相生,根骨提升8%,身法提升10%
煉武·根骨與绝命相生,氣勁提升10%,根骨提升8%
煉武·根骨與拜月·冰心相生,氣勁提升11%,根骨提升9%
==============================================
力道+116 气劲+212 根骨+121
洞察+155 身法+120
外功攻击+37 内功攻击+29
外功防御+0 内功防御+0
命中率+10.875% 格挡+0% 会心率+4.86%
气血+0 韧劲+3.08% 会心伤害+0%
